# ServerId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceReference..::..ServerId Property
ExternalResourceReference Class See Also
---
The id of the server that Revit is expecting to provide the external resource.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Guid ServerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServerId As Guid
	Get
```

Visual C++
---
```text
public:
property Guid ServerId {
	Guid get ();
}
```

# See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace